app/controllers/cadastros_controller.rb

SELECT "cadastros".* FROM "cadastros"
---
  def index
    @cadastros = Cadastro.all

INSERT INTO "cadastros" ("nome", "descricao", "cidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", ""], ["descricao", ""], ["cidade", ""], ["created_at", "2017-08-07 01:03:35.291924"], ["updated_at", "2017-08-07 01:03:35.291924"]]
---
  def create
    @cadastro = Cadastro.new(cadastro_params)

    respond_to do |format|
      if @cadastro.save

UPDATE "cadastros" SET "inicio" = ?, "fim" = ?, "updated_at" = ? WHERE "cadastros"."id" = ?  [["inicio", "2012-12-12"], ["fim", "2012-01-01"], ["updated_at", "2017-08-07 00:08:38.418548"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @cadastro.update(cadastro_params)

DELETE FROM "cadastros" WHERE "cadastros"."id" = ?  [["id", 1]]
---
  def destroy
    @cadastro.destroy

SELECT  "cadastros".* FROM "cadastros" WHERE "cadastros"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_cadastro
      @cadastro = Cadastro.find(params[:id])